***** exp
#+begin_src clojure
(for [n (range 10)]                                        ;; <1>
  (* n n))                                                 ;; <2>
#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected

#+begin_src clojure
(let [sides-list (list [4.2 6] [4 4] [3 4] [5.5 3])
      hypo-list (for [sides sides-list]                           
                  (Math/sqrt (+ (Math/pow (first sides) 2)        
                                (Math/pow (second sides) 2))))]
      hypo-list)
#+end_src

#+begin_src clojure
(let [sides-list (list [4.2 6] [4 4] [3 4] [5.5 3])
      hypo-list (for [sides sides-list]                           
                  (Math/sqrt (+ (Math/pow (first sides) 2)        
                                (Math/pow (second sides) 2))))]
  (for [sides sides-list
        c hypo-list]
    (let [a (get sides 0)
          b (get sides 1)]
      [a b c]
      ;; [a b]
      )))
#+end_src

#+RESULTS:
| 4.2 | 6 | 7.323933369440222 |
| 4.2 | 6 | 5.656854249492381 |
| 4.2 | 6 |               5.0 |
| 4.2 | 6 | 6.264982043070834 |
|   4 | 4 | 7.323933369440222 |
|   4 | 4 | 5.656854249492381 |
|   4 | 4 |               5.0 |
|   4 | 4 | 6.264982043070834 |
|   3 | 4 | 7.323933369440222 |
|   3 | 4 | 5.656854249492381 |
|   3 | 4 |               5.0 |
|   3 | 4 | 6.264982043070834 |
| 5.5 | 3 | 7.323933369440222 |
| 5.5 | 3 | 5.656854249492381 |
| 5.5 | 3 |               5.0 |
| 5.5 | 3 | 6.264982043070834 |


#+begin_src clojure
(let [sides-list (list [4.2 6] [4 4] [3 4] [5.5 3])
      hypo-list (for [sides sides-list]                           
                  (Math/sqrt (+ (Math/pow (first sides) 2)        
                                (Math/pow (second sides) 2))))]
  (for [sides sides-list
        c     hypo-list
        :let [a (get sides 0)
              b (get sides 1)]]
      [a b c]))
#+end_src

#+RESULTS:
| 4.2 | 6 | 7.323933369440222 |
| 4.2 | 6 | 5.656854249492381 |
| 4.2 | 6 |               5.0 |
| 4.2 | 6 | 6.264982043070834 |
|   4 | 4 | 7.323933369440222 |
|   4 | 4 | 5.656854249492381 |
|   4 | 4 |               5.0 |
|   4 | 4 | 6.264982043070834 |
|   3 | 4 | 7.323933369440222 |
|   3 | 4 | 5.656854249492381 |
|   3 | 4 |               5.0 |
|   3 | 4 | 6.264982043070834 |
| 5.5 | 3 | 7.323933369440222 |
| 5.5 | 3 | 5.656854249492381 |
| 5.5 | 3 |               5.0 |
| 5.5 | 3 | 6.264982043070834 |

#+begin_src clojure
(let [sides-list (list [4.2 6] [4 4] [3 4] [5.5 3])]
  (for [sides sides-list
        :let [a (first sides)
              b (second sides)
              c (Math/sqrt (+ (Math/pow a 2) (Math/pow b 2)))]]                           
    [a b c]))
#+end_src

#+RESULTS:
| 4.2 | 6 | 7.323933369440222 |
|   4 | 4 | 5.656854249492381 |
|   3 | 4 |               5.0 |
| 5.5 | 3 | 6.264982043070834 |
****** 01
#+begin_src clojure

(def cart [{:name "Silicone Pancake Mold" :price 10.49}
                       {:name "Small Pour-Over Coffee Maker" :price 18.96}
                       {:name "Digital Kitchen Scale" :price 24.95}])

(def tax-rate 0.079)
(defn add-sales-tax [cart-item]                ;; <1>
              (let [{:keys [price]} cart-item]
                (assoc cart-item :sales-tax (* price tax-rate))))

(add-sales-tax {:name "Medium T-Shirt"         ;; <2>
                            :price 10.00})


(map add-sales-tax cart)                       ;; <3>

#+end_src

#+RESULTS:
| #'user/cart                                                                                                                                                                                                               |
| #'user/tax-rate                                                                                                                                                                                                           |
| #'user/add-sales-tax                                                                                                                                                                                                      |
| {:name "Medium T-Shirt", :price 10.0, :sales-tax 0.79}                                                                                                                                                                    |
| ({:name "Silicone Pancake Mold", :price 10.49, :sales-tax 0.8287100000000001} {:name "Small Pour-Over Coffee Maker", :price 18.96, :sales-tax 1.49784} {:name "Digital Kitchen Scale", :price 24.95, :sales-tax 1.97105}) |
****** 02

#+begin_src clojure
(map add-sales-tax cart)                       ;; <3>
#+end_src

#+RESULTS:
| :name | Silicone Pancake Mold        | :price | 10.49 | :sales-tax | 0.8287100000000001 |
| :name | Small Pour-Over Coffee Maker | :price | 18.96 | :sales-tax |            1.49784 |
| :name | Digital Kitchen Scale        | :price | 24.95 | :sales-tax |            1.97105 |

******* 001
#+begin_src clojure
(map #(:name %) cart)                       ;; <3>
#+end_src

#+RESULTS:
| Silicone Pancake Mold | Small Pour-Over Coffee Maker | Digital Kitchen Scale |

******* 002
#+begin_src clojure
(map (fn [elm] (:name elm)) cart)                       ;; <3>
#+end_src

#+RESULTS:
| Silicone Pancake Mold | Small Pour-Over Coffee Maker | Digital Kitchen Scale |

******* 003
#+begin_src clojure
(map #(:name %1) cart)                       ;; <3>
#+end_src

#+RESULTS:
| Silicone Pancake Mold | Small Pour-Over Coffee Maker | Digital Kitchen Scale |

******* defn

#+begin_src clojure
(defn discount [products pct-discount]
  (map (fn [product] (assoc product :price (* pct-discount (:price product)))) products))
#+end_src

#+RESULTS:
: #'user/discount
****** repl
#+begin_src clojure
(def events [{:event :click, :timestamp 1463889739}
             {:event :typing, :timestamp 1463889745}
             {:event :click, :timestamp 1463889746}
             {:event :click, :timestamp 1463889753}])
#+end_src

#+RESULTS:
: #'user/events

#+begin_src clojure
(defn longest-idle-time [events]
  (:max-idle                                               ;; <1>
    (reduce (fn [{:keys [max-idle last-ts]} event]         ;; <2>
              (let [ts (:timestamp event)
                    idle-time (- ts last-ts)]
                {:max-idle (max max-idle idle-time)        ;; <3>
                 :last-ts ts}))
            {:max-idle 0
             :last-ts (:timestamp (first events))}         ;; <4>
            events)))
#+end_src

#+RESULTS:
: #'user/longest-idle-time

#+begin_src clojure
(longest-idle-time events)
#+end_src

#+RESULTS:
: 7

#+begin_src clojure
(defn count-user-clicks [events]
  (reduce #(if (= :click (:event %2))
                 (inc %1)
                 %1)
          0 events))
#+end_src

#+begin_src clojure
(defn count-user-clicks [events]
  (reduce (fn [clicks-sum event]
            (if (= (:event event) :click )
                 (inc clicks-sum)
                 clicks-sum))
          0 events))

(count-user-clicks events)
#+end_src

#+begin_src clojure
(defn count-user-clicks [events]
  (reduce (fn [clicks-sum event]
            (or (= (:event event) :click )
                 (inc clicks-sum)
                 clicks-sum))
          0 events))

(count-user-clicks events)
#+end_src
#+RESULTS:
| #'user/count-user-clicks |
|                        3 |

#+begin_src clojure
(count-user-clicks events)
#+end_src

#+RESULTS:
: 3

#+begin_src clojure
(def duble-click-max-lag 1)
(defn count-user-duble-clicks [events]
  (reduce (fn [last-event new-event]
            (unless (:clicks-sum last-event)
                      (assoc last-event :clicks-sum 0))
            (when (= (:event new-event) :click )
              (when (last-event new-event)
              (assoc last-event :clicks-sum (inc clicks-sum))
                 clicks-sum))
                  )
          0 events))

(count-user-duble-clicks events)
#+end_src

#+begin_src clojure
;; (defn test [{clicks-sum :clicks-sum
(defn test [{un-clicks-sum :clicks-sum
             last-ts :timestamp}
            {new-event :event
             new-ts :timestamp}]
  ;; (println last-event)
  ;; (when-not (integer? clicks-sum) (def clicks-sum 0))
  ;; (let [clicks-sum 1]
  ;;  [clicks-sum last-ts new-event last-ts])
  ;; (def clicks-sum 1)
  (let [clicks-sum
        (if (and (= new-event :click )
                 (> duble-click-max-lag
                 (- new-ts last-ts)))
        (inc un-clicks-sum)
        0)]
        ;; 0]
          ;; (inc clicks-sum))))
  ;; [clicks-sum last-ts new-event last-ts]
  ;; (def clicks-sum (inc clicks-sum))
  ;; (inc clicks-sum)
  [clicks-sum (- new-ts last-ts)
   (> duble-click-max-lag (- new-ts last-ts))
    (and (= new-event :click )
                            (> duble-click-max-lag
                               (- new-ts last-ts)))])
  ;; (println clicks-sum)
  ;; (println last-ts)
  ;; (println "test ok")
  )

;; (test (first events) (second events))
;; (events 3)
(test (events 2) (events 3))
#+end_src

#+RESULTS:
| #'user/test                          |
| class java.lang.NullPointerException |

#+begin_src clojure
(test (first events) (second events))
#+end_src

#+RESULTS:
: 1463889745

#+begin_src clojure
(def duble-click-max-lag 1)
#+end_src

#+begin_src clojure
(defn count-user-duble-clicks [events]
  (:clicks-sum
   (reduce (fn [{;; last-event :event
                un-clicks-sum :clicks-sum
                last-ts :timestamp}
                {new-event :event
                new-ts :timestamp}]
            (let [clicks-sum (if (integer? un-clicks-sum) un-clicks-sum 0)]
              (when (= new-event :click )
                (when (> duble-click-max-lag
                        (- new-ts last-ts)
                      (inc clicks-sum))))
                {;; :event last-event
                :clicks-sum clicks-sum 
                :timestamp last-ts}))
          events)))

(count-user-duble-clicks events)
#+end_src

#+RESULTS:
| #'user/count-user-duble-clicks |
|                              0 |

#+begin_src clojure
(def duble-click-max-lag 10000000000000000)
(count-user-duble-clicks events)
#+end_src

#+begin_src clojure
(def duble-click-max-lag 10000000000000000)
(inc duble-click-max-lag)
duble-click-max-lag
#+end_src

#+RESULTS:
| #'user/duble-click-max-lag |
|                          0 |

#+begin_src clojure
(defn its-biger? [old new]
  (let [delta (- (:timestamp new) (:timestamp old))]
    (if (< (:bigest old) delta)
      {:bigest delta, :timestamp (:timestamp new)}
      {:bigest (:bigest old), :timestamp (:timestamp new)})
    ))

(reduce #() {:bigest 0, :timestamp (:timestamp (ferst events))} events)

#+end_src
***** recur

#+begin_src clojure
(defn factorial
 ([n] (factorial n 1 []))
 ([n result result-list]
  (if (<= n 1)
    result-list
    (recur (dec n) (* result n) (conj result-list (* result n))))))

(factorial 5)
#+end_src

#+RESULTS:
| #'user/factorial |
| [5 20 60 120]    |
***** repl
#+begin_src clojure
(try
  :success
  (catch :default _
    :failure))

#+end_src

#+begin_src clojure
(try
                (throw {:type :custom-error
                                                :message "Something unpleasant occurred"})
                (catch :default e
                        (println "Caught value:" e)))
#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected

***** Sequence
#+begin_src clojure

(def samples [[8 12 4]
              [9 3 3 6]
              [11 4]])

#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected

**** tax card
#+begin_src clojure
(ns shopping-cart.core
  (:require [goog.dom :as gdom]))

(def tax-rate 0.079)
(def cart [{:name "Silicone Pancake Mold" :price 10.49 :taxable? false}
           {:name "Small Pour-Over Coffee Maker" :price 18.96 :taxable? true}
           {:name "Digital Kitchen Scale" :price 24.95 :taxable? true}])

(defn add-sales-tax [cart-item]
  (assoc cart-item
         :sales-tax (* (:price cart-item) tax-rate)))

(def taxable-cart
  (map add-sales-tax
       (filter :taxable? cart)))

(def item-list (gdom/createDom "ul" nil ""))

;; Helper function to generate the display text for a product
(defn display-item [item]
  (str (:name item)
       ": "
       (:price item)
       " (tax: "
       (.toFixed (:sales-tax item) 2)
       ")"))

;; Create the list of products
(doseq [item taxable-cart]
  (gdom/appendChild
   item-list
   (gdom/createDom "li" #js {} (display-item item))))

;; Clear the entire document and append the list
(gdom/removeChildren (.-body js/document))
(gdom/appendChild (.-body js/document) item-list)
#+end_src

#+RESULTS:
: Please reevaluate when nREPL is connected
** tree weather
#+begin_src eshell
tree -a ./weather/
#+end_src

#+RESULTS:
#+begin_example
./weather/
|-- .gitignore
|-- README.md
|-- deps.edn
|-- dev.cljs.edn
|-- figwheel-main.edn
|-- resources
|   `-- public
|       |-- css
|       |   `-- style.css
|       |-- index.html
|       `-- test.html
|-- src
|   `-- learn_cljs
|       `-- weather.cljs
|-- target
|   `-- public
|-- test
|   `-- learn_cljs
|       |-- test_runner.cljs
|       `-- weather_test.cljs
`-- test.cljs.edn

10 directories, 12 files
#+end_example

#+begin_src eshell
tree -a ../..
#+end_src

** tree
#+begin_src eshell
tree -a 
#+end_src

#+RESULTS:
#+begin_example
.
|-- .cpcache
|   |-- 2249099292.basis
|   |-- 2249099292.cp
|   |-- 2249099292.main
|   |-- 3387647126.basis
|   `-- 3387647126.cp
|-- .git
|   |-- COMMIT_EDITMSG
|   |-- HEAD
|   |-- branches
|   |-- config
|   |-- description
|   |-- hooks
|   |   |-- applypatch-msg.sample
|   |   |-- commit-msg.sample
|   |   |-- fsmonitor-watchman.sample
|   |   |-- post-update.sample
|   |   |-- pre-applypatch.sample
|   |   |-- pre-commit.sample
|   |   |-- pre-merge-commit.sample
|   |   |-- pre-push.sample
|   |   |-- pre-rebase.sample
|   |   |-- pre-receive.sample
|   |   |-- prepare-commit-msg.sample
|   |   |-- push-to-checkout.sample
|   |   |-- sendemail-validate.sample
|   |   `-- update.sample
|   |-- index
|   |-- info
|   |   `-- exclude
|   |-- logs
|   |   |-- HEAD
|   |   `-- refs
|   |       `-- heads
|   |           `-- master
|   |-- objects
|   |   |-- 0c
|   |   |   `-- bbd03849c4225b912c29c5cc1a1eb95e004406
|   |   |-- 0e
|   |   |   `-- 870ed249cff3194b020b449194b8cba79a49d3
|   |   |-- 17
|   |   |   `-- a3e74549f59d14a57aaa5d946f87798ecd2d27
|   |   |-- 1f
|   |   |   `-- 93999b09a0a7b82e830a7b9090f0551d0f280e
|   |   |-- 32
|   |   |   `-- 4d99a0a2eb602de5639061c10905a14f2ec25c
|   |   |-- 45
|   |   |   `-- 374bcfb2934e4cb107dd25d948d3b9a008f723
|   |   |-- 50
|   |   |   `-- 6579660ab72264aaa634f26bf26ae7ffbdc418
|   |   |-- 64
|   |   |   `-- 5a17d70fa7f64e2c3119372d253464688197af
|   |   |-- 65
|   |   |   `-- a5e52de8afa978f2bb081da49308b6cd34291d
|   |   |-- 68
|   |   |   `-- d8c0c529bb0772b6720ad9e763d778f384d54c
|   |   |-- 6a
|   |   |   `-- 3417b8d9d0a2fec34cf79ef2b46cc63a28b7d8
|   |   |-- 71
|   |   |   `-- 0abb86e53c60cd50c35ef8e3c3974ecd5a166c
|   |   |-- 78
|   |   |   `-- 57d22f338d2bf5a11f2c9989019274e89e11bf
|   |   |-- 8e
|   |   |   `-- 9d30e7d6e5c5c5cf8797dddb89c36afcd3ba53
|   |   |-- a4
|   |   |   `-- 5fa94e812daa483ce03c6d57b8406559ba308c
|   |   |-- a9
|   |   |   `-- 3c6e57355bd80bf964904be7322c2f011e0d22
|   |   |-- af
|   |   |   `-- 4f6bcd17f983891885b2da5bb50d94247eafde
|   |   |-- b5
|   |   |   `-- 37353beaf2793d612857b56c29e2c6bfc6f3bb
|   |   |-- bf
|   |   |   `-- 8bf5fb01b57c3c6914e97292b05eadeb0b78a6
|   |   |-- c0
|   |   |   `-- 75bf98b67f24573980200a3389426360f42eed
|   |   |-- c4
|   |   |   `-- 49315d9c35a5d2431f95a1d2d4e4831a3a00af
|   |   |-- cd
|   |   |   `-- fc3fe15c3684ed37efdd455b8de454e72d0ea0
|   |   |-- d5
|   |   |   `-- e6c53f1c5365bb3647bf2c492687effb1a4034
|   |   |-- de
|   |   |   `-- 743adcae8dd63e093efe46f514c7536e24752a
|   |   |-- ee
|   |   |   `-- d014ac3bfe7e79af47e2e71dbbb5348f55c8a3
|   |   |-- fb
|   |   |   `-- 9af43c306f53f296e24ec6309badfcf4e1345c
|   |   |-- info
|   |   `-- pack
|   `-- refs
|       |-- heads
|       |   `-- master
|       `-- tags
|-- .gitignore
|-- deps.edn
|-- index.html
|-- my-cljs-project.org
|-- out
|   |-- cljs
|   |   |-- core.cljs
|   |   |-- core.js
|   |   |-- core.js.map
|   |   |-- pprint.cljs
|   |   |-- pprint.cljs.cache.json
|   |   |-- pprint.js
|   |   |-- pprint.js.map
|   |   |-- repl.cljs
|   |   |-- repl.cljs.cache.json
|   |   |-- repl.js
|   |   |-- repl.js.map
|   |   `-- spec
|   |       |-- alpha.cljs
|   |       |-- alpha.cljs.cache.json
|   |       |-- alpha.js
|   |       |-- alpha.js.map
|   |       `-- gen
|   |           |-- alpha.cljs
|   |           |-- alpha.cljs.cache.json
|   |           |-- alpha.js
|   |           `-- alpha.js.map
|   |-- cljs_deps.js
|   |-- cljsc_opts.edn
|   |-- clojure
|   |   |-- browser
|   |   |   |-- event.cljs
|   |   |   |-- event.cljs.cache.json
|   |   |   |-- event.js
|   |   |   |-- event.js.map
|   |   |   |-- net.cljs
|   |   |   |-- net.cljs.cache.json
|   |   |   |-- net.js
|   |   |   |-- net.js.map
|   |   |   |-- repl
|   |   |   |   |-- preload.cljs
|   |   |   |   |-- preload.cljs.cache.json
|   |   |   |   |-- preload.js
|   |   |   |   `-- preload.js.map
|   |   |   |-- repl.cljs
|   |   |   |-- repl.cljs.cache.json
|   |   |   |-- repl.js
|   |   |   `-- repl.js.map
|   |   |-- string.cljs
|   |   |-- string.cljs.cache.json
|   |   |-- string.js
|   |   |-- string.js.map
|   |   |-- walk.cljs
|   |   |-- walk.cljs.cache.json
|   |   |-- walk.js
|   |   `-- walk.js.map
|   |-- goog
|   |   |-- array
|   |   |   `-- array.js
|   |   |-- asserts
|   |   |   `-- asserts.js
|   |   |-- async
|   |   |   |-- delay.js
|   |   |   |-- freelist.js
|   |   |   |-- nexttick.js
|   |   |   |-- run.js
|   |   |   `-- workqueue.js
|   |   |-- base.js
|   |   |-- debug
|   |   |   |-- debug.js
|   |   |   |-- entrypointregistry.js
|   |   |   |-- error.js
|   |   |   |-- errorcontext.js
|   |   |   |-- logbuffer.js
|   |   |   |-- logger.js
|   |   |   `-- logrecord.js
|   |   |-- deps.js
|   |   |-- disposable
|   |   |   |-- disposable.js
|   |   |   `-- idisposable.js
|   |   |-- dom
|   |   |   |-- asserts.js
|   |   |   |-- browserfeature.js
|   |   |   |-- dom.js
|   |   |   |-- htmlelement.js
|   |   |   |-- nodetype.js
|   |   |   |-- safe.js
|   |   |   |-- tagname.js
|   |   |   `-- tags.js
|   |   |-- events
|   |   |   |-- browserevent.js
|   |   |   |-- browserfeature.js
|   |   |   |-- event.js
|   |   |   |-- eventhandler.js
|   |   |   |-- eventid.js
|   |   |   |-- events.js
|   |   |   |-- eventtarget.js
|   |   |   |-- eventtype.js
|   |   |   |-- listenable.js
|   |   |   |-- listener.js
|   |   |   `-- listenermap.js
|   |   |-- fs
|   |   |   `-- url.js
|   |   |-- functions
|   |   |   `-- functions.js
|   |   |-- html
|   |   |   |-- legacyconversions.js
|   |   |   |-- safehtml.js
|   |   |   |-- safescript.js
|   |   |   |-- safestyle.js
|   |   |   |-- safestylesheet.js
|   |   |   |-- safeurl.js
|   |   |   |-- trustedresourceurl.js
|   |   |   |-- trustedtypes.js
|   |   |   `-- uncheckedconversions.js
|   |   |-- i18n
|   |   |   `-- bidi.js
|   |   |-- iter
|   |   |   `-- iter.js
|   |   |-- json
|   |   |   |-- hybrid.js
|   |   |   `-- json.js
|   |   |-- labs
|   |   |   `-- useragent
|   |   |       |-- browser.js
|   |   |       |-- engine.js
|   |   |       |-- platform.js
|   |   |       `-- util.js
|   |   |-- log
|   |   |   `-- log.js
|   |   |-- math
|   |   |   |-- coordinate.js
|   |   |   |-- integer.js
|   |   |   |-- long.js
|   |   |   |-- math.js
|   |   |   `-- size.js
|   |   |-- messaging
|   |   |   |-- abstractchannel.js
|   |   |   `-- messagechannel.js
|   |   |-- mochikit
|   |   |   `-- async
|   |   |       `-- deferred.js
|   |   |-- net
|   |   |   |-- errorcode.js
|   |   |   |-- eventtype.js
|   |   |   |-- httpstatus.js
|   |   |   |-- websocket.js
|   |   |   |-- wrapperxmlhttpfactory.js
|   |   |   |-- xhrio.js
|   |   |   |-- xhrlike.js
|   |   |   |-- xmlhttp.js
|   |   |   |-- xmlhttpfactory.js
|   |   |   `-- xpc
|   |   |       |-- crosspagechannel.js
|   |   |       |-- crosspagechannelrole.js
|   |   |       |-- directtransport.js
|   |   |       |-- nativemessagingtransport.js
|   |   |       |-- transport.js
|   |   |       `-- xpc.js
|   |   |-- object
|   |   |   `-- object.js
|   |   |-- promise
|   |   |   |-- promise.js
|   |   |   |-- resolver.js
|   |   |   `-- thenable.js
|   |   |-- reflect
|   |   |   `-- reflect.js
|   |   |-- string
|   |   |   |-- const.js
|   |   |   |-- internal.js
|   |   |   |-- string.js
|   |   |   |-- stringbuffer.js
|   |   |   |-- stringformat.js
|   |   |   `-- typedstring.js
|   |   |-- structs
|   |   |   |-- map.js
|   |   |   `-- structs.js
|   |   |-- timer
|   |   |   `-- timer.js
|   |   |-- uri
|   |   |   |-- uri.js
|   |   |   `-- utils.js
|   |   `-- useragent
|   |       |-- product.js
|   |       `-- useragent.js
|   |-- main.js
|   |-- my_cljs_project
|   |   |-- core.cljs
|   |   |-- core.cljs.cache.json
|   |   |-- core.js
|   |   `-- core.js.map
|   `-- process
|       |-- env.cljs
|       |-- env.cljs.cache.json
|       |-- env.js
|       `-- env.js.map
`-- src
    `-- my_cljs_project
        `-- core.cljs

83 directories, 211 files
#+end_example

#+begin_src eshell
tree -a ../..
#+end_src

